name: "ResNet-101"
	input: "data"
	input_shape{
	dim: 1
	dim: 3
	dim: 384
	dim: 512
}

# my Python layer: ResizeLayer
layer {
	bottom: "data"
	top: "l_resize"
	name: "l_resize"
	type: "Python"
	python_param {
		module: 'custom_layers'
		layer: 'ResizeLayer'
		param_str: "{'h': 192, 'w': 256, 'mean': [103.93900299, 116.77899933, 123.68000031]}"  # original
		# param_str: "{'h': 140, 'w': 248, 'mean': [117.80904, 130.27611, 134.65074]}"  # cover
		# param_str: "{'h': 192, 'w': 256, 'mean': [99.74151, 108.75074, 113.17747]}"  # Oxford
		# param_str: "{'h': 192, 'w': 256, 'mean': [107.464, 111.302, 114.55]}"  # Paris		
	}
}

layer {
	bottom: "data"
	top: "m_resize"
	name: "m_resize"
	type: "Python"
	python_param {
		module: 'custom_layers'
		layer: 'ResizeLayer'
		param_str: "{'h': 384, 'w': 512, 'mean': [103.93900299, 116.77899933, 123.68000031]}"  # original
		# param_str: "{'h': 280, 'w': 496, 'mean': [117.80904, 130.27611, 134.65074]}"  # cover
		# param_str: "{'h': 384, 'w': 512, 'mean': [99.74151, 108.75074, 113.17747]}"  # Oxford
		# param_str: "{'h': 384, 'w': 512, 'mean': [107.464, 111.302, 114.55]}"  # Paris	
	}
}

layer {
	bottom: "data"
	top: "h_resize"
	name: "h_resize"
	type: "Python"
	python_param {
		module: 'custom_layers'
		layer: 'ResizeLayer'
		param_str: "{'h': 576, 'w': 768, 'mean': [103.93900299, 116.77899933, 123.68000031]}"  # original
		# param_str: "{'h': 420, 'w': 744, 'mean': [117.80904, 130.27611, 134.65074]}"  # cover
		# param_str: "{'h': 576, 'w': 768, 'mean': [99.74151, 108.75074, 113.17747]}"  # Oxford
		# param_str: "{'h': 576, 'w': 768, 'mean': [107.464, 111.302, 114.55]}"  # Paris	
	}
}

# my Python layer: RigidGridLayer
layer {
	bottom: "l_resize"
	top: "l_rois"
	name: "l_rois"
	type: "Python"
	python_param {
		module: 'custom_layers'
		layer: 'RigidGridLayer'
		param_str: "{'dataset': 'other'}"
	}
}

layer {
	bottom: "m_resize"
	top: "m_rois"
	name: "m_rois"
	type: "Python"
	python_param {
		module: 'custom_layers'
		layer: 'RigidGridLayer'
		param_str: "{'dataset': 'other'}"
	}
}

layer {
	bottom: "h_resize"
	top: "h_rois"
	name: "h_rois"
	type: "Python"
	python_param {
		module: 'custom_layers'
		layer: 'RigidGridLayer'
		param_str: "{'dataset': 'other'}"
	}
}

# Teacher network
layer {
	bottom: "l_resize"
	top: "l_conv1"
	name: "l_conv1"
	type: "Convolution"
	param {
		name: "conv1_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 64
		kernel_size: 7
		pad: 3
		stride: 2
		bias_term: false
	}
}

layer {
	bottom: "l_conv1"
	top: "l_conv1"
	name: "l_bn_conv1"
	type: "BatchNorm"
	param {
		name: "bn_conv1_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn_conv1_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn_conv1_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_conv1"
	top: "l_conv1"
	name: "l_scale_conv1"
	type: "Scale"
	param {
		name: "scale_conv1_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale_conv1_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_conv1"
	bottom: "l_conv1"
	name: "l_conv1_relu"
	type: "ReLU"
}

layer {
	bottom: "l_conv1"
	top: "l_pool1"
	name: "l_pool1"
	type: "Pooling"
	pooling_param {
		kernel_size: 3
		stride: 2
		pool: MAX
	}
}

layer {
	bottom: "l_pool1"
	top: "l_res2a_branch1"
	name: "l_res2a_branch1"
	type: "Convolution"
	param {
		name: "res2a_branch1_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res2a_branch1"
	top: "l_res2a_branch1"
	name: "l_bn2a_branch1"
	type: "BatchNorm"
	param {
		name: "bn2a_branch1_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2a_branch1_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2a_branch1_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res2a_branch1"
	top: "l_res2a_branch1"
	name: "l_scale2a_branch1"
	type: "Scale"
	param {
		name: "scale2a_branch1_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale2a_branch1_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_pool1"
	top: "l_res2a_branch2a"
	name: "l_res2a_branch2a"
	type: "Convolution"
	param {
		name: "res2a_branch2a_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res2a_branch2a"
	top: "l_res2a_branch2a"
	name: "l_bn2a_branch2a"
	type: "BatchNorm"
	param {
		name: "bn2a_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2a_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2a_branch2a_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res2a_branch2a"
	top: "l_res2a_branch2a"
	name: "l_scale2a_branch2a"
	type: "Scale"
	param {
		name: "scale2a_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale2a_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res2a_branch2a"
	bottom: "l_res2a_branch2a"
	name: "l_res2a_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res2a_branch2a"
	top: "l_res2a_branch2b"
	name: "l_res2a_branch2b"
	type: "Convolution"
	param {
		name: "res2a_branch2b_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res2a_branch2b"
	top: "l_res2a_branch2b"
	name: "l_bn2a_branch2b"
	type: "BatchNorm"
	param {
		name: "bn2a_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2a_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2a_branch2b_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res2a_branch2b"
	top: "l_res2a_branch2b"
	name: "l_scale2a_branch2b"
	type: "Scale"
	param {
		name: "scale2a_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale2a_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res2a_branch2b"
	bottom: "l_res2a_branch2b"
	name: "l_res2a_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res2a_branch2b"
	top: "l_res2a_branch2c"
	name: "l_res2a_branch2c"
	type: "Convolution"
	param {
		name: "res2a_branch2c_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res2a_branch2c"
	top: "l_res2a_branch2c"
	name: "l_bn2a_branch2c"
	type: "BatchNorm"
	param {
		name: "bn2a_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2a_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2a_branch2c_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res2a_branch2c"
	top: "l_res2a_branch2c"
	name: "l_scale2a_branch2c"
	type: "Scale"
	param {
		name: "scale2a_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale2a_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res2a_branch1"
	bottom: "l_res2a_branch2c"
	top: "l_res2a"
	name: "l_res2a"
	type: "Eltwise"
}

layer {
	bottom: "l_res2a"
	top: "l_res2a"
	name: "l_res2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res2a"
	top: "l_res2b_branch2a"
	name: "l_res2b_branch2a"
	type: "Convolution"
	param {
		name: "res2b_branch2a_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res2b_branch2a"
	top: "l_res2b_branch2a"
	name: "l_bn2b_branch2a"
	type: "BatchNorm"
	param {
		name: "bn2b_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2b_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2b_branch2a_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res2b_branch2a"
	top: "l_res2b_branch2a"
	name: "l_scale2b_branch2a"
	type: "Scale"
	param {
		name: "scale2b_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale2b_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res2b_branch2a"
	bottom: "l_res2b_branch2a"
	name: "l_res2b_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res2b_branch2a"
	top: "l_res2b_branch2b"
	name: "l_res2b_branch2b"
	type: "Convolution"
	param {
		name: "res2b_branch2b_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res2b_branch2b"
	top: "l_res2b_branch2b"
	name: "l_bn2b_branch2b"
	type: "BatchNorm"
	param {
		name: "bn2b_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2b_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2b_branch2b_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res2b_branch2b"
	top: "l_res2b_branch2b"
	name: "l_scale2b_branch2b"
	type: "Scale"
	param {
		name: "scale2b_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale2b_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res2b_branch2b"
	bottom: "l_res2b_branch2b"
	name: "l_res2b_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res2b_branch2b"
	top: "l_res2b_branch2c"
	name: "l_res2b_branch2c"
	type: "Convolution"
	param {
		name: "res2b_branch2c_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res2b_branch2c"
	top: "l_res2b_branch2c"
	name: "l_bn2b_branch2c"
	type: "BatchNorm"
	param {
		name: "bn2b_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2b_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2b_branch2c_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res2b_branch2c"
	top: "l_res2b_branch2c"
	name: "l_scale2b_branch2c"
	type: "Scale"
	param {
		name: "scale2b_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale2b_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res2a"
	bottom: "l_res2b_branch2c"
	top: "l_res2b"
	name: "l_res2b"
	type: "Eltwise"
}

layer {
	bottom: "l_res2b"
	top: "l_res2b"
	name: "l_res2b_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res2b"
	top: "l_res2c_branch2a"
	name: "l_res2c_branch2a"
	type: "Convolution"
	param {
		name: "res2c_branch2a_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res2c_branch2a"
	top: "l_res2c_branch2a"
	name: "l_bn2c_branch2a"
	type: "BatchNorm"
	param {
		name: "bn2c_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2c_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2c_branch2a_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res2c_branch2a"
	top: "l_res2c_branch2a"
	name: "l_scale2c_branch2a"
	type: "Scale"
	param {
		name: "scale2c_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale2c_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res2c_branch2a"
	bottom: "l_res2c_branch2a"
	name: "l_res2c_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res2c_branch2a"
	top: "l_res2c_branch2b"
	name: "l_res2c_branch2b"
	type: "Convolution"
	param {
		name: "res2c_branch2b_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res2c_branch2b"
	top: "l_res2c_branch2b"
	name: "l_bn2c_branch2b"
	type: "BatchNorm"
	param {
		name: "bn2c_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2c_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2c_branch2b_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res2c_branch2b"
	top: "l_res2c_branch2b"
	name: "l_scale2c_branch2b"
	type: "Scale"
	param {
		name: "scale2c_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale2c_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res2c_branch2b"
	bottom: "l_res2c_branch2b"
	name: "l_res2c_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res2c_branch2b"
	top: "l_res2c_branch2c"
	name: "l_res2c_branch2c"
	type: "Convolution"
	param {
		name: "res2c_branch2c_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res2c_branch2c"
	top: "l_res2c_branch2c"
	name: "l_bn2c_branch2c"
	type: "BatchNorm"
	param {
		name: "bn2c_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2c_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn2c_branch2c_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res2c_branch2c"
	top: "l_res2c_branch2c"
	name: "l_scale2c_branch2c"
	type: "Scale"
	param {
		name: "scale2c_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale2c_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res2b"
	bottom: "l_res2c_branch2c"
	top: "l_res2c"
	name: "l_res2c"
	type: "Eltwise"
}

layer {
	bottom: "l_res2c"
	top: "l_res2c"
	name: "l_res2c_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res2c"
	top: "l_res3a_branch1"
	name: "l_res3a_branch1"
	type: "Convolution"
	param {
		name: "res3a_branch1_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
	bottom: "l_res3a_branch1"
	top: "l_res3a_branch1"
	name: "l_bn3a_branch1"
	type: "BatchNorm"
	param {
		name: "bn3a_branch1_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3a_branch1_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3a_branch1_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res3a_branch1"
	top: "l_res3a_branch1"
	name: "l_scale3a_branch1"
	type: "Scale"
	param {
		name: "scale3a_branch1_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale3a_branch1_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res2c"
	top: "l_res3a_branch2a"
	name: "l_res3a_branch2a"
	type: "Convolution"
	param {
		name: "res3a_branch2a_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
	bottom: "l_res3a_branch2a"
	top: "l_res3a_branch2a"
	name: "l_bn3a_branch2a"
	type: "BatchNorm"
	param {
		name: "bn3a_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3a_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3a_branch2a_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res3a_branch2a"
	top: "l_res3a_branch2a"
	name: "l_scale3a_branch2a"
	type: "Scale"
	param {
		name: "scale3a_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale3a_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res3a_branch2a"
	bottom: "l_res3a_branch2a"
	name: "l_res3a_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res3a_branch2a"
	top: "l_res3a_branch2b"
	name: "l_res3a_branch2b"
	type: "Convolution"
	param {
		name: "res3a_branch2b_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res3a_branch2b"
	top: "l_res3a_branch2b"
	name: "l_bn3a_branch2b"
	type: "BatchNorm"
	param {
		name: "bn3a_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3a_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3a_branch2b_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res3a_branch2b"
	top: "l_res3a_branch2b"
	name: "l_scale3a_branch2b"
	type: "Scale"
	param {
		name: "scale3a_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale3a_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res3a_branch2b"
	bottom: "l_res3a_branch2b"
	name: "l_res3a_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res3a_branch2b"
	top: "l_res3a_branch2c"
	name: "l_res3a_branch2c"
	type: "Convolution"
	param {
		name: "res3a_branch2c_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res3a_branch2c"
	top: "l_res3a_branch2c"
	name: "l_bn3a_branch2c"
	type: "BatchNorm"
	param {
		name: "bn3a_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3a_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3a_branch2c_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res3a_branch2c"
	top: "l_res3a_branch2c"
	name: "l_scale3a_branch2c"
	type: "Scale"
	param {
		name: "scale3a_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale3a_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res3a_branch1"
	bottom: "l_res3a_branch2c"
	top: "l_res3a"
	name: "l_res3a"
	type: "Eltwise"
}

layer {
	bottom: "l_res3a"
	top: "l_res3a"
	name: "l_res3a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res3a"
	top: "l_res3b1_branch2a"
	name: "l_res3b1_branch2a"
	type: "Convolution"
	param {
		name: "res3b1_branch2a_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res3b1_branch2a"
	top: "l_res3b1_branch2a"
	name: "l_bn3b1_branch2a"
	type: "BatchNorm"
	param {
		name: "bn3b1_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b1_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b1_branch2a_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res3b1_branch2a"
	top: "l_res3b1_branch2a"
	name: "l_scale3b1_branch2a"
	type: "Scale"
	param {
		name: "scale3b1_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale3b1_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res3b1_branch2a"
	bottom: "l_res3b1_branch2a"
	name: "l_res3b1_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res3b1_branch2a"
	top: "l_res3b1_branch2b"
	name: "l_res3b1_branch2b"
	type: "Convolution"
	param {
		name: "res3b1_branch2b_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res3b1_branch2b"
	top: "l_res3b1_branch2b"
	name: "l_bn3b1_branch2b"
	type: "BatchNorm"
	param {
		name: "bn3b1_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b1_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b1_branch2b_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res3b1_branch2b"
	top: "l_res3b1_branch2b"
	name: "l_scale3b1_branch2b"
	type: "Scale"
	param {
		name: "scale3b1_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale3b1_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res3b1_branch2b"
	bottom: "l_res3b1_branch2b"
	name: "l_res3b1_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res3b1_branch2b"
	top: "l_res3b1_branch2c"
	name: "l_res3b1_branch2c"
	type: "Convolution"
	param {
		name: "res3b1_branch2c_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res3b1_branch2c"
	top: "l_res3b1_branch2c"
	name: "l_bn3b1_branch2c"
	type: "BatchNorm"
	param {
		name: "bn3b1_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b1_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b1_branch2c_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res3b1_branch2c"
	top: "l_res3b1_branch2c"
	name: "l_scale3b1_branch2c"
	type: "Scale"
	param {
		name: "scale3b1_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale3b1_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res3a"
	bottom: "l_res3b1_branch2c"
	top: "l_res3b1"
	name: "l_res3b1"
	type: "Eltwise"
}

layer {
	bottom: "l_res3b1"
	top: "l_res3b1"
	name: "l_res3b1_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res3b1"
	top: "l_res3b2_branch2a"
	name: "l_res3b2_branch2a"
	type: "Convolution"
	param {
		name: "res3b2_branch2a_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res3b2_branch2a"
	top: "l_res3b2_branch2a"
	name: "l_bn3b2_branch2a"
	type: "BatchNorm"
	param {
		name: "bn3b2_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b2_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b2_branch2a_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res3b2_branch2a"
	top: "l_res3b2_branch2a"
	name: "l_scale3b2_branch2a"
	type: "Scale"
	param {
		name: "scale3b2_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale3b2_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res3b2_branch2a"
	bottom: "l_res3b2_branch2a"
	name: "l_res3b2_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res3b2_branch2a"
	top: "l_res3b2_branch2b"
	name: "l_res3b2_branch2b"
	type: "Convolution"
	param {
		name: "res3b2_branch2b_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res3b2_branch2b"
	top: "l_res3b2_branch2b"
	name: "l_bn3b2_branch2b"
	type: "BatchNorm"
	param {
		name: "bn3b2_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b2_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b2_branch2b_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res3b2_branch2b"
	top: "l_res3b2_branch2b"
	name: "l_scale3b2_branch2b"
	type: "Scale"
	param {
		name: "scale3b2_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale3b2_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res3b2_branch2b"
	bottom: "l_res3b2_branch2b"
	name: "l_res3b2_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res3b2_branch2b"
	top: "l_res3b2_branch2c"
	name: "l_res3b2_branch2c"
	type: "Convolution"
	param {
		name: "res3b2_branch2c_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res3b2_branch2c"
	top: "l_res3b2_branch2c"
	name: "l_bn3b2_branch2c"
	type: "BatchNorm"
	param {
		name: "bn3b2_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b2_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b2_branch2c_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res3b2_branch2c"
	top: "l_res3b2_branch2c"
	name: "l_scale3b2_branch2c"
	type: "Scale"
	param {
		name: "scale3b2_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale3b2_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res3b1"
	bottom: "l_res3b2_branch2c"
	top: "l_res3b2"
	name: "l_res3b2"
	type: "Eltwise"
}

layer {
	bottom: "l_res3b2"
	top: "l_res3b2"
	name: "l_res3b2_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res3b2"
	top: "l_res3b3_branch2a"
	name: "l_res3b3_branch2a"
	type: "Convolution"
	param {
		name: "res3b3_branch2a_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res3b3_branch2a"
	top: "l_res3b3_branch2a"
	name: "l_bn3b3_branch2a"
	type: "BatchNorm"
	param {
		name: "bn3b3_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b3_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b3_branch2a_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res3b3_branch2a"
	top: "l_res3b3_branch2a"
	name: "l_scale3b3_branch2a"
	type: "Scale"
	param {
		name: "scale3b3_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale3b3_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res3b3_branch2a"
	bottom: "l_res3b3_branch2a"
	name: "l_res3b3_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res3b3_branch2a"
	top: "l_res3b3_branch2b"
	name: "l_res3b3_branch2b"
	type: "Convolution"
	param {
		name: "res3b3_branch2b_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res3b3_branch2b"
	top: "l_res3b3_branch2b"
	name: "l_bn3b3_branch2b"
	type: "BatchNorm"
	param {
		name: "bn3b3_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b3_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b3_branch2b_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res3b3_branch2b"
	top: "l_res3b3_branch2b"
	name: "l_scale3b3_branch2b"
	type: "Scale"
	param {
		name: "scale3b3_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale3b3_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res3b3_branch2b"
	bottom: "l_res3b3_branch2b"
	name: "l_res3b3_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res3b3_branch2b"
	top: "l_res3b3_branch2c"
	name: "l_res3b3_branch2c"
	type: "Convolution"
	param {
		name: "res3b3_branch2c_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res3b3_branch2c"
	top: "l_res3b3_branch2c"
	name: "l_bn3b3_branch2c"
	type: "BatchNorm"
	param {
		name: "bn3b3_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b3_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn3b3_branch2c_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res3b3_branch2c"
	top: "l_res3b3_branch2c"
	name: "l_scale3b3_branch2c"
	type: "Scale"
	param {
		name: "scale3b3_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale3b3_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res3b2"
	bottom: "l_res3b3_branch2c"
	top: "l_res3b3"
	name: "l_res3b3"
	type: "Eltwise"
}

layer {
	bottom: "l_res3b3"
	top: "l_res3b3"
	name: "l_res3b3_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res3b3"
	top: "l_res4a_branch1"
	name: "l_res4a_branch1"
	type: "Convolution"
	param {
		name: "res4a_branch1_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
	bottom: "l_res4a_branch1"
	top: "l_res4a_branch1"
	name: "l_bn4a_branch1"
	type: "BatchNorm"
	param {
		name: "bn4a_branch1_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4a_branch1_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4a_branch1_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4a_branch1"
	top: "l_res4a_branch1"
	name: "l_scale4a_branch1"
	type: "Scale"
	param {
		name: "scale4a_branch1_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4a_branch1_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res3b3"
	top: "l_res4a_branch2a"
	name: "l_res4a_branch2a"
	type: "Convolution"
	param {
		name: "res4a_branch2a_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
	bottom: "l_res4a_branch2a"
	top: "l_res4a_branch2a"
	name: "l_bn4a_branch2a"
	type: "BatchNorm"
	param {
		name: "bn4a_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4a_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4a_branch2a_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4a_branch2a"
	top: "l_res4a_branch2a"
	name: "l_scale4a_branch2a"
	type: "Scale"
	param {
		name: "scale4a_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4a_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res4a_branch2a"
	bottom: "l_res4a_branch2a"
	name: "l_res4a_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4a_branch2a"
	top: "l_res4a_branch2b"
	name: "l_res4a_branch2b"
	type: "Convolution"
	param {
		name: "res4a_branch2b_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4a_branch2b"
	top: "l_res4a_branch2b"
	name: "l_bn4a_branch2b"
	type: "BatchNorm"
	param {
		name: "bn4a_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4a_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4a_branch2b_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4a_branch2b"
	top: "l_res4a_branch2b"
	name: "l_scale4a_branch2b"
	type: "Scale"
	param {
		name: "scale4a_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4a_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res4a_branch2b"
	bottom: "l_res4a_branch2b"
	name: "l_res4a_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4a_branch2b"
	top: "l_res4a_branch2c"
	name: "l_res4a_branch2c"
	type: "Convolution"
	param {
		name: "res4a_branch2c_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4a_branch2c"
	top: "l_res4a_branch2c"
	name: "l_bn4a_branch2c"
	type: "BatchNorm"
	param {
		name: "bn4a_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4a_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4a_branch2c_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4a_branch2c"
	top: "l_res4a_branch2c"
	name: "l_scale4a_branch2c"
	type: "Scale"
	param {
		name: "scale4a_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4a_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res4a_branch1"
	bottom: "l_res4a_branch2c"
	top: "l_res4a"
	name: "l_res4a"
	type: "Eltwise"
}

layer {
	bottom: "l_res4a"
	top: "l_res4a"
	name: "l_res4a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4a"
	top: "l_res4b1_branch2a"
	name: "l_res4b1_branch2a"
	type: "Convolution"
	param {
		name: "res4b1_branch2a_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b1_branch2a"
	top: "l_res4b1_branch2a"
	name: "l_bn4b1_branch2a"
	type: "BatchNorm"
	param {
		name: "bn4b1_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b1_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b1_branch2a_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b1_branch2a"
	top: "l_res4b1_branch2a"
	name: "l_scale4b1_branch2a"
	type: "Scale"
	param {
		name: "scale4b1_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b1_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res4b1_branch2a"
	bottom: "l_res4b1_branch2a"
	name: "l_res4b1_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b1_branch2a"
	top: "l_res4b1_branch2b"
	name: "l_res4b1_branch2b"
	type: "Convolution"
	param {
		name: "res4b1_branch2b_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b1_branch2b"
	top: "l_res4b1_branch2b"
	name: "l_bn4b1_branch2b"
	type: "BatchNorm"
	param {
		name: "bn4b1_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b1_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b1_branch2b_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b1_branch2b"
	top: "l_res4b1_branch2b"
	name: "l_scale4b1_branch2b"
	type: "Scale"
	param {
		name: "scale4b1_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b1_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res4b1_branch2b"
	bottom: "l_res4b1_branch2b"
	name: "l_res4b1_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b1_branch2b"
	top: "l_res4b1_branch2c"
	name: "l_res4b1_branch2c"
	type: "Convolution"
	param {
		name: "res4b1_branch2c_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b1_branch2c"
	top: "l_res4b1_branch2c"
	name: "l_bn4b1_branch2c"
	type: "BatchNorm"
	param {
		name: "bn4b1_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b1_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b1_branch2c_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b1_branch2c"
	top: "l_res4b1_branch2c"
	name: "l_scale4b1_branch2c"
	type: "Scale"
	param {
		name: "scale4b1_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b1_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res4a"
	bottom: "l_res4b1_branch2c"
	top: "l_res4b1"
	name: "l_res4b1"
	type: "Eltwise"
}

layer {
	bottom: "l_res4b1"
	top: "l_res4b1"
	name: "l_res4b1_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b1"
	top: "l_res4b2_branch2a"
	name: "l_res4b2_branch2a"
	type: "Convolution"
	param {
		name: "res4b2_branch2a_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b2_branch2a"
	top: "l_res4b2_branch2a"
	name: "l_bn4b2_branch2a"
	type: "BatchNorm"
	param {
		name: "bn4b2_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b2_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b2_branch2a_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b2_branch2a"
	top: "l_res4b2_branch2a"
	name: "l_scale4b2_branch2a"
	type: "Scale"
	param {
		name: "scale4b2_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b2_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res4b2_branch2a"
	bottom: "l_res4b2_branch2a"
	name: "l_res4b2_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b2_branch2a"
	top: "l_res4b2_branch2b"
	name: "l_res4b2_branch2b"
	type: "Convolution"
	param {
		name: "res4b2_branch2b_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b2_branch2b"
	top: "l_res4b2_branch2b"
	name: "l_bn4b2_branch2b"
	type: "BatchNorm"
	param {
		name: "bn4b2_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b2_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b2_branch2b_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b2_branch2b"
	top: "l_res4b2_branch2b"
	name: "l_scale4b2_branch2b"
	type: "Scale"
	param {
		name: "scale4b2_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b2_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res4b2_branch2b"
	bottom: "l_res4b2_branch2b"
	name: "l_res4b2_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b2_branch2b"
	top: "l_res4b2_branch2c"
	name: "l_res4b2_branch2c"
	type: "Convolution"
	param {
		name: "res4b2_branch2c_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b2_branch2c"
	top: "l_res4b2_branch2c"
	name: "l_bn4b2_branch2c"
	type: "BatchNorm"
	param {
		name: "bn4b2_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b2_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b2_branch2c_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b2_branch2c"
	top: "l_res4b2_branch2c"
	name: "l_scale4b2_branch2c"
	type: "Scale"
	param {
		name: "scale4b2_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b2_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res4b1"
	bottom: "l_res4b2_branch2c"
	top: "l_res4b2"
	name: "l_res4b2"
	type: "Eltwise"
}

layer {
	bottom: "l_res4b2"
	top: "l_res4b2"
	name: "l_res4b2_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b2"
	top: "l_res4b3_branch2a"
	name: "l_res4b3_branch2a"
	type: "Convolution"
	param {
		name: "res4b3_branch2a_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b3_branch2a"
	top: "l_res4b3_branch2a"
	name: "l_bn4b3_branch2a"
	type: "BatchNorm"
	param {
		name: "bn4b3_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b3_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b3_branch2a_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b3_branch2a"
	top: "l_res4b3_branch2a"
	name: "l_scale4b3_branch2a"
	type: "Scale"
	param {
		name: "scale4b3_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b3_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res4b3_branch2a"
	bottom: "l_res4b3_branch2a"
	name: "l_res4b3_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b3_branch2a"
	top: "l_res4b3_branch2b"
	name: "l_res4b3_branch2b"
	type: "Convolution"
	param {
		name: "res4b3_branch2b_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b3_branch2b"
	top: "l_res4b3_branch2b"
	name: "l_bn4b3_branch2b"
	type: "BatchNorm"
	param {
		name: "bn4b3_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b3_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b3_branch2b_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b3_branch2b"
	top: "l_res4b3_branch2b"
	name: "l_scale4b3_branch2b"
	type: "Scale"
	param {
		name: "scale4b3_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b3_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res4b3_branch2b"
	bottom: "l_res4b3_branch2b"
	name: "l_res4b3_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b3_branch2b"
	top: "l_res4b3_branch2c"
	name: "l_res4b3_branch2c"
	type: "Convolution"
	param {
		name: "res4b3_branch2c_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b3_branch2c"
	top: "l_res4b3_branch2c"
	name: "l_bn4b3_branch2c"
	type: "BatchNorm"
	param {
		name: "bn4b3_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b3_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b3_branch2c_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b3_branch2c"
	top: "l_res4b3_branch2c"
	name: "l_scale4b3_branch2c"
	type: "Scale"
	param {
		name: "scale4b3_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b3_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res4b2"
	bottom: "l_res4b3_branch2c"
	top: "l_res4b3"
	name: "l_res4b3"
	type: "Eltwise"
}

layer {
	bottom: "l_res4b3"
	top: "l_res4b3"
	name: "l_res4b3_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b3"
	top: "l_res4b4_branch2a"
	name: "l_res4b4_branch2a"
	type: "Convolution"
	param {
		name: "res4b4_branch2a_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b4_branch2a"
	top: "l_res4b4_branch2a"
	name: "l_bn4b4_branch2a"
	type: "BatchNorm"
	param {
		name: "bn4b4_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b4_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b4_branch2a_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b4_branch2a"
	top: "l_res4b4_branch2a"
	name: "l_scale4b4_branch2a"
	type: "Scale"
	param {
		name: "scale4b4_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b4_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res4b4_branch2a"
	bottom: "l_res4b4_branch2a"
	name: "l_res4b4_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b4_branch2a"
	top: "l_res4b4_branch2b"
	name: "l_res4b4_branch2b"
	type: "Convolution"
	param {
		name: "res4b4_branch2b_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b4_branch2b"
	top: "l_res4b4_branch2b"
	name: "l_bn4b4_branch2b"
	type: "BatchNorm"
	param {
		name: "bn4b4_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b4_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b4_branch2b_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b4_branch2b"
	top: "l_res4b4_branch2b"
	name: "l_scale4b4_branch2b"
	type: "Scale"
	param {
		name: "scale4b4_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b4_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res4b4_branch2b"
	bottom: "l_res4b4_branch2b"
	name: "l_res4b4_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b4_branch2b"
	top: "l_res4b4_branch2c"
	name: "l_res4b4_branch2c"
	type: "Convolution"
	param {
		name: "res4b4_branch2c_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b4_branch2c"
	top: "l_res4b4_branch2c"
	name: "l_bn4b4_branch2c"
	type: "BatchNorm"
	param {
		name: "bn4b4_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b4_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b4_branch2c_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b4_branch2c"
	top: "l_res4b4_branch2c"
	name: "l_scale4b4_branch2c"
	type: "Scale"
	param {
		name: "scale4b4_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b4_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res4b3"
	bottom: "l_res4b4_branch2c"
	top: "l_res4b4"
	name: "l_res4b4"
	type: "Eltwise"
}

layer {
	bottom: "l_res4b4"
	top: "l_res4b4"
	name: "l_res4b4_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b4"
	top: "l_res4b5_branch2a"
	name: "l_res4b5_branch2a"
	type: "Convolution"
	param {
		name: "res4b5_branch2a_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b5_branch2a"
	top: "l_res4b5_branch2a"
	name: "l_bn4b5_branch2a"
	type: "BatchNorm"
	param {
		name: "bn4b5_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b5_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b5_branch2a_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b5_branch2a"
	top: "l_res4b5_branch2a"
	name: "l_scale4b5_branch2a"
	type: "Scale"
	param {
		name: "scale4b5_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b5_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res4b5_branch2a"
	bottom: "l_res4b5_branch2a"
	name: "l_res4b5_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b5_branch2a"
	top: "l_res4b5_branch2b"
	name: "l_res4b5_branch2b"
	type: "Convolution"
	param {
		name: "res4b5_branch2b_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b5_branch2b"
	top: "l_res4b5_branch2b"
	name: "l_bn4b5_branch2b"
	type: "BatchNorm"
	param {
		name: "bn4b5_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b5_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b5_branch2b_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b5_branch2b"
	top: "l_res4b5_branch2b"
	name: "l_scale4b5_branch2b"
	type: "Scale"
	param {
		name: "scale4b5_branch2b_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b5_branch2b_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res4b5_branch2b"
	bottom: "l_res4b5_branch2b"
	name: "l_res4b5_branch2b_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b5_branch2b"
	top: "l_res4b5_branch2c"
	name: "l_res4b5_branch2c"
	type: "Convolution"
	param {
		name: "res4b5_branch2c_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b5_branch2c"
	top: "l_res4b5_branch2c"
	name: "l_bn4b5_branch2c"
	type: "BatchNorm"
	param {
		name: "bn4b5_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b5_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b5_branch2c_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b5_branch2c"
	top: "l_res4b5_branch2c"
	name: "l_scale4b5_branch2c"
	type: "Scale"
	param {
		name: "scale4b5_branch2c_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b5_branch2c_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	bottom: "l_res4b4"
	bottom: "l_res4b5_branch2c"
	top: "l_res4b5"
	name: "l_res4b5"
	type: "Eltwise"
}

layer {
	bottom: "l_res4b5"
	top: "l_res4b5"
	name: "l_res4b5_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b5"
	top: "l_res4b6_branch2a"
	name: "l_res4b6_branch2a"
	type: "Convolution"
	param {
		name: "res4b6_branch2a_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b6_branch2a"
	top: "l_res4b6_branch2a"
	name: "l_bn4b6_branch2a"
	type: "BatchNorm"
	param {
		name: "bn4b6_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b6_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "bn4b6_branch2a_3"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "l_res4b6_branch2a"
	top: "l_res4b6_branch2a"
	name: "l_scale4b6_branch2a"
	type: "Scale"
	param {
		name: "scale4b6_branch2a_1"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	param {
		name: "scale4b6_branch2a_2"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	scale_param {
		bias_term: true
	}
}

layer {
	top: "l_res4b6_branch2a"
	bottom: "l_res4b6_branch2a"
	name: "l_res4b6_branch2a_relu"
	type: "ReLU"
}

layer {
	bottom: "l_res4b6_branch2a"
	top: "l_res4b6_branch2b"
	name: "l_res4b6_branch2b"
	type: "Convolution"
	param {
		name: "res4b6_branch2b_w"
		lr_mult: 0.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
	bottom: "l_res4b6_branch2b"
	top: "l_res4b6_branch2b"
	name: "l_bn4b6_branch2b"
	type: "BatchNorm"
	param {
		name: "bn4b6_branch2b_1"
		lr_mult: 0.0
